#include <iostream>
using namespace std;

int main() {
	// Бинарные операторы - работают с двумя операндами

	// арифметические операторы
	cout << "5 + 2 = " << 5 + 2 << '\n';
	cout << "5 * 2 = " << 5 * 2 << '\n';
	cout << "5 / 2 = " << 5.0 / 2.0 << '\n';
	cout << "5 % 2 = " << 5 % 2 << '\n';
	cout << "5 - 2 = " << 5 - 2 << '\n';

	// оператор присвоения
	int a = 2;
	cout << "a = " << a << '\n';
	a -= 2; // a = a - 2;
	cout << "a - 2 = " << a << '\n';
	a += 3;
	cout << "a + 3 = " << a << '\n';
	a *= 3;
	cout << "a * 3 = " << a << '\n';
	a /= 2;
	cout << "a / 2 = " << a << '\n';
	a %= 3;
	cout << "a % 3 = " << a << '\n';

	// Унарные операторы - работают с одним операндом
	cout << "-a = " << -a << '\n';
	a++; // инкремент (a += 1)
	cout << "a++ = " << a << '\n';
	a--; // декремент (a -= 1)
	cout << "a-- = " << a << '\n';
	cout << " a++ = " << a++ << '\n';
	cout << " a-- = " << a-- << '\n';
	cout << " ++a = " << ++a << '\n';
	cout << " --a = " << --a << '\n';

	// логические операторы
	cout << boolalpha;
	cout << "5 == 5 = " << (5 == 5) << '\n';
	cout << "a == 5 = " << (a == 5) << '\n';
	cout << "a > 5 = " << (a > 5) << '\n';
	cout << "a < 5 = " << (a < 5) << '\n';
	cout << "a >= 5 = " << (a >= 5) << '\n';
	cout << "a <= 1 = " << (a <= 1) << '\n';

	bool b = true;
	bool c = false;
	// ! - NOT
	cout << "!b = " << !b << '\n';
	// && - AND
	cout << "b && c = " << (b && c) << '\n';
	// || - OR
	cout << "b || c = " << (b || c) << '\n';
	// NAND
	cout << "!(b && c) = " << !(b && c) << '\n';
	// NOR
	cout << "!(b || c) = " << !(b || c) << '\n';
	// XOR
	cout << "(b || c) && !(b && c) = " << ((b || c) && !(b && c)) << '\n';
	


	return 0;
}