// Это комментарии к программе
// они выделяются зелёным цветом

//	однострочный комментарий

/*		
	много-
	-строчный
	коммен-
	-тарий
*/

// подключаем программную библиотеку
// iostream
// Библиотека - файл, содержащий описание
// различных функций, реализованных другими программистами
#include <iostream>

// В языке С++ существует понятие "пространства имён"
// Это пространство определяет некоторую область, на которую
// приходятся действия оператора или функции. И для того
// чтобы использовать оператор, необходимо подключить
// пространство имён в свою программу
using namespace std;

// точка входа в программу, начало работы программы
// Сигнатура метода:
// [модификатор доступа] [тип возвращаемого значения] [название метода] (принимаемые аргументы) {тело метода}
//int main()
//{
//	// Escape-последовательности:
//	// \b - удаление последнего выведенного символа
//	// \n - перейти на начало новой строки
//	// \t - перейти к следующей позиции табуляции
//	// \\ - вывести обратную черту \
//	// \" - вывести двойную кавычку "
//	// \' - вывести одинарную кавычку '
//
//	setlocale(LC_ALL, "");
//	cout << "Привет, Мир!";
//
//	return 0;
//}
